zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXN/periph/PERI_AHBSC.h
#define AHBSC_SEC_CPU1_INT_MASK2_INT91_MASK_MASK (0x8000000U)
#define AHBSC_SEC_CPU1_INT_MASK2_INT91_MASK_SHIFT (27U)
/*! INT91_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK2_INT91_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK2_INT91_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK2_INT91_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK2_INT92_MASK_MASK (0x10000000U)
#define AHBSC_SEC_CPU1_INT_MASK2_INT92_MASK_SHIFT (28U)
/*! INT92_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK2_INT92_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK2_INT92_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK2_INT92_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK2_INT93_MASK_MASK (0x20000000U)
#define AHBSC_SEC_CPU1_INT_MASK2_INT93_MASK_SHIFT (29U)
/*! INT93_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK2_INT93_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK2_INT93_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK2_INT93_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK2_INT94_MASK_MASK (0x40000000U)
#define AHBSC_SEC_CPU1_INT_MASK2_INT94_MASK_SHIFT (30U)
/*! INT94_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK2_INT94_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK2_INT94_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK2_INT94_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK2_INT95_MASK_MASK (0x80000000U)
#define AHBSC_SEC_CPU1_INT_MASK2_INT95_MASK_SHIFT (31U)
/*! INT95_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK2_INT95_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK2_INT95_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK2_INT95_MASK_MASK)
/*! @} */

/*! @name SEC_CPU1_INT_MASK3 - Secure Interrupt Mask 3 for CPU1 */
/*! @{ */

#define AHBSC_SEC_CPU1_INT_MASK3_INT96_MASK_MASK (0x1U)
#define AHBSC_SEC_CPU1_INT_MASK3_INT96_MASK_SHIFT (0U)
/*! INT96_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK3_INT96_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK3_INT96_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK3_INT96_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK3_INT97_MASK_MASK (0x2U)
#define AHBSC_SEC_CPU1_INT_MASK3_INT97_MASK_SHIFT (1U)
/*! INT97_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK3_INT97_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK3_INT97_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK3_INT97_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK3_INT98_MASK_MASK (0x4U)
#define AHBSC_SEC_CPU1_INT_MASK3_INT98_MASK_SHIFT (2U)
/*! INT98_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK3_INT98_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK3_INT98_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK3_INT98_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK3_INT99_MASK_MASK (0x8U)
#define AHBSC_SEC_CPU1_INT_MASK3_INT99_MASK_SHIFT (3U)
/*! INT99_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK3_INT99_MASK(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK3_INT99_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK3_INT99_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK3_INT100_MASK_MASK (0x10U)
#define AHBSC_SEC_CPU1_INT_MASK3_INT100_MASK_SHIFT (4U)
/*! INT100_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK3_INT100_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK3_INT100_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK3_INT100_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK3_INT101_MASK_MASK (0x20U)
#define AHBSC_SEC_CPU1_INT_MASK3_INT101_MASK_SHIFT (5U)
/*! INT101_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK3_INT101_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK3_INT101_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK3_INT101_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK3_INT102_MASK_MASK (0x40U)
#define AHBSC_SEC_CPU1_INT_MASK3_INT102_MASK_SHIFT (6U)
/*! INT102_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK3_INT102_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK3_INT102_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK3_INT102_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK3_INT103_MASK_MASK (0x80U)
#define AHBSC_SEC_CPU1_INT_MASK3_INT103_MASK_SHIFT (7U)
/*! INT103_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK3_INT103_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK3_INT103_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK3_INT103_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK3_INT104_MASK_MASK (0x100U)
#define AHBSC_SEC_CPU1_INT_MASK3_INT104_MASK_SHIFT (8U)
/*! INT104_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK3_INT104_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK3_INT104_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK3_INT104_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK3_INT105_MASK_MASK (0x200U)
#define AHBSC_SEC_CPU1_INT_MASK3_INT105_MASK_SHIFT (9U)
/*! INT105_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK3_INT105_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK3_INT105_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK3_INT105_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK3_INT106_MASK_MASK (0x400U)
#define AHBSC_SEC_CPU1_INT_MASK3_INT106_MASK_SHIFT (10U)
/*! INT106_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK3_INT106_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK3_INT106_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK3_INT106_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK3_INT107_MASK_MASK (0x800U)
#define AHBSC_SEC_CPU1_INT_MASK3_INT107_MASK_SHIFT (11U)
/*! INT107_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK3_INT107_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK3_INT107_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK3_INT107_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK3_INT108_MASK_MASK (0x1000U)
#define AHBSC_SEC_CPU1_INT_MASK3_INT108_MASK_SHIFT (12U)
/*! INT108_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK3_INT108_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK3_INT108_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK3_INT108_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK3_INT109_MASK_MASK (0x2000U)
#define AHBSC_SEC_CPU1_INT_MASK3_INT109_MASK_SHIFT (13U)
/*! INT109_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK3_INT109_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK3_INT109_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK3_INT109_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK3_INT110_MASK_MASK (0x4000U)
#define AHBSC_SEC_CPU1_INT_MASK3_INT110_MASK_SHIFT (14U)
/*! INT110_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK3_INT110_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK3_INT110_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK3_INT110_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK3_INT111_MASK_MASK (0x8000U)
#define AHBSC_SEC_CPU1_INT_MASK3_INT111_MASK_SHIFT (15U)
/*! INT111_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK3_INT111_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK3_INT111_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK3_INT111_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK3_INT112_MASK_MASK (0x10000U)
#define AHBSC_SEC_CPU1_INT_MASK3_INT112_MASK_SHIFT (16U)
/*! INT112_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK3_INT112_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK3_INT112_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK3_INT112_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK3_INT113_MASK_MASK (0x20000U)
#define AHBSC_SEC_CPU1_INT_MASK3_INT113_MASK_SHIFT (17U)
/*! INT113_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK3_INT113_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK3_INT113_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK3_INT113_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK3_INT114_MASK_MASK (0x40000U)
#define AHBSC_SEC_CPU1_INT_MASK3_INT114_MASK_SHIFT (18U)
/*! INT114_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK3_INT114_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK3_INT114_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK3_INT114_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK3_INT115_MASK_MASK (0x80000U)
#define AHBSC_SEC_CPU1_INT_MASK3_INT115_MASK_SHIFT (19U)
/*! INT115_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK3_INT115_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK3_INT115_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK3_INT115_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK3_INT116_MASK_MASK (0x100000U)
#define AHBSC_SEC_CPU1_INT_MASK3_INT116_MASK_SHIFT (20U)
/*! INT116_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK3_INT116_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK3_INT116_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK3_INT116_MASK_MASK)

