zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXN/periph/PERI_AHBSC.h
#define AHBSC_SEC_CPU1_INT_MASK4_INT134_MASK_MASK (0x40U)
#define AHBSC_SEC_CPU1_INT_MASK4_INT134_MASK_SHIFT (6U)
/*! INT134_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK4_INT134_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK4_INT134_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK4_INT134_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK4_INT135_MASK_MASK (0x80U)
#define AHBSC_SEC_CPU1_INT_MASK4_INT135_MASK_SHIFT (7U)
/*! INT135_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK4_INT135_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK4_INT135_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK4_INT135_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK4_INT136_MASK_MASK (0x100U)
#define AHBSC_SEC_CPU1_INT_MASK4_INT136_MASK_SHIFT (8U)
/*! INT136_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK4_INT136_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK4_INT136_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK4_INT136_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK4_INT137_MASK_MASK (0x200U)
#define AHBSC_SEC_CPU1_INT_MASK4_INT137_MASK_SHIFT (9U)
/*! INT137_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK4_INT137_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK4_INT137_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK4_INT137_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK4_INT138_MASK_MASK (0x400U)
#define AHBSC_SEC_CPU1_INT_MASK4_INT138_MASK_SHIFT (10U)
/*! INT138_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK4_INT138_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK4_INT138_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK4_INT138_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK4_INT139_MASK_MASK (0x800U)
#define AHBSC_SEC_CPU1_INT_MASK4_INT139_MASK_SHIFT (11U)
/*! INT139_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK4_INT139_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK4_INT139_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK4_INT139_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK4_INT140_MASK_MASK (0x1000U)
#define AHBSC_SEC_CPU1_INT_MASK4_INT140_MASK_SHIFT (12U)
/*! INT140_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK4_INT140_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK4_INT140_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK4_INT140_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK4_INT141_MASK_MASK (0x2000U)
#define AHBSC_SEC_CPU1_INT_MASK4_INT141_MASK_SHIFT (13U)
/*! INT141_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK4_INT141_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK4_INT141_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK4_INT141_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK4_INT142_MASK_MASK (0x4000U)
#define AHBSC_SEC_CPU1_INT_MASK4_INT142_MASK_SHIFT (14U)
/*! INT142_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK4_INT142_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK4_INT142_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK4_INT142_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK4_INT143_MASK_MASK (0x8000U)
#define AHBSC_SEC_CPU1_INT_MASK4_INT143_MASK_SHIFT (15U)
/*! INT143_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK4_INT143_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK4_INT143_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK4_INT143_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK4_INT144_MASK_MASK (0x10000U)
#define AHBSC_SEC_CPU1_INT_MASK4_INT144_MASK_SHIFT (16U)
/*! INT144_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK4_INT144_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK4_INT144_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK4_INT144_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK4_INT145_MASK_MASK (0x20000U)
#define AHBSC_SEC_CPU1_INT_MASK4_INT145_MASK_SHIFT (17U)
/*! INT145_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK4_INT145_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK4_INT145_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK4_INT145_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK4_INT146_MASK_MASK (0x40000U)
#define AHBSC_SEC_CPU1_INT_MASK4_INT146_MASK_SHIFT (18U)
/*! INT146_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK4_INT146_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK4_INT146_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK4_INT146_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK4_INT147_MASK_MASK (0x80000U)
#define AHBSC_SEC_CPU1_INT_MASK4_INT147_MASK_SHIFT (19U)
/*! INT147_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK4_INT147_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK4_INT147_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK4_INT147_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK4_INT148_MASK_MASK (0x100000U)
#define AHBSC_SEC_CPU1_INT_MASK4_INT148_MASK_SHIFT (20U)
/*! INT148_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK4_INT148_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK4_INT148_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK4_INT148_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK4_INT149_MASK_MASK (0x200000U)
#define AHBSC_SEC_CPU1_INT_MASK4_INT149_MASK_SHIFT (21U)
/*! INT149_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK4_INT149_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK4_INT149_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK4_INT149_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK4_INT150_MASK_MASK (0x400000U)
#define AHBSC_SEC_CPU1_INT_MASK4_INT150_MASK_SHIFT (22U)
/*! INT150_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK4_INT150_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK4_INT150_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK4_INT150_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK4_INT151_MASK_MASK (0x800000U)
#define AHBSC_SEC_CPU1_INT_MASK4_INT151_MASK_SHIFT (23U)
/*! INT151_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK4_INT151_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK4_INT151_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK4_INT151_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK4_INT152_MASK_MASK (0x1000000U)
#define AHBSC_SEC_CPU1_INT_MASK4_INT152_MASK_SHIFT (24U)
/*! INT152_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK4_INT152_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK4_INT152_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK4_INT152_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK4_INT153_MASK_MASK (0x2000000U)
#define AHBSC_SEC_CPU1_INT_MASK4_INT153_MASK_SHIFT (25U)
/*! INT153_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK4_INT153_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK4_INT153_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK4_INT153_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK4_INT154_MASK_MASK (0x4000000U)
#define AHBSC_SEC_CPU1_INT_MASK4_INT154_MASK_SHIFT (26U)
/*! INT154_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK4_INT154_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK4_INT154_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK4_INT154_MASK_MASK)

#define AHBSC_SEC_CPU1_INT_MASK4_INT155_MASK_MASK (0x8000000U)
#define AHBSC_SEC_CPU1_INT_MASK4_INT155_MASK_SHIFT (27U)
/*! INT155_MASK - Mask bit
 *  0b0..Masked
 *  0b1..Not masked
 */
#define AHBSC_SEC_CPU1_INT_MASK4_INT155_MASK(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_CPU1_INT_MASK4_INT155_MASK_SHIFT)) & AHBSC_SEC_CPU1_INT_MASK4_INT155_MASK_MASK)

